Revit 2024 API
MetalFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "MetalFinish" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum MetalFinishType
Visual Basic
Public Enumeration MetalFinishType
Visual C++
public enum class MetalFinishType
Members
Member name | Description
Polished
SemiPolished
Satin
Brushed
See Also
Autodesk.Revit.DB.Visual Namespace